TightSquad/HABIP-MSP430/fram_sdcard_imu_pwm_adc_3/fram_sdcard_imu_pwm_adc_3.c
/*******************************************************************************
 *
 * main.c
 *
 * Out of Box Demo for the MSP-EXP430FR5994
 * Main loop, initialization, and interrupt service routines
 *
 * Feb 2016
 * E. Chen
 *
 ******************************************************************************/

//#include "main.h"
//#include "LiveTempMode.h"
//#include "FRAMLogMode.h"
#include "SDCardLogMode.h"
#include "driverlib.h"
#include "daqcs_imu.h"
#include "daqcs_motor.h"
#include "daqcs_adc.h"

extern int mode;
extern int pingHost;

//uint8_t RXData = 0;                               // UART Receive byte
int mode = 0;                                     // mode selection variable
int pingHost = 0;                                 // ping request from PC GUI
int noSDCard = 0;
Calendar calendar;                                // Calendar used for RTC

Calendar currTime;

#define WRITE_SIZE      6000
#define COL_SIZE      4

unsigned char count = 0;
unsigned long data;

//#pragma PERSISTENT(FRAM_write)
//signed short int FRAM_write[WRITE_SIZE][COL_SIZE] = {0};

#pragma PERSISTENT(fram_data)
unsigned short fram_data[0x10000] = {0};

void Init_GPIO(void);
void Init_Clock(void);
void Init_RTC(void);
void enterLPM35(void);
void blinkP1OUT(int blink_number);


//signed int data_array [500];
//signed int ms_array [500];
//uint8_t FRAM_write[6000][4];


//-----------------------------------------------------------------------------
int _system_pre_init(void)
{
    // Stop Watchdog timer
    WDT_A_hold(__MSP430_BASEADDRESS_WDT_A__);     // Stop WDT

    GPIO_setOutputHighOnPin(GPIO_PORT_P5, GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_PIN7);

    /*==================================*/
    /* Choose if segment initialization */
    /* should be done or not. */
    /* Return: 0 to omit initialization */
    /* 1 to run initialization */
    /*==================================*/
    return 1;
}

/*
 * main.c
 */
int main(void) {

	Init_GPIO();

	GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);

    // Board initializations
    Init_Clock();

    // create the folder on SD card
    storeTimeStampSDCard();

	int log_num = 0;
	int blink_count = 0;
	char time_sec[8];
	char curr_ms[8];
	int curr_sec;
	//uint32_t currMS;
	signed short z_gyro_data;
	char z_gyro_char[8];
	char adc_char[8];
	int current_adc_val;
	long rtc_ms;

	long row = 0;

	int motor_duty_cycle = 2000;
	int second_counter = 0;
	int period_counter = 0;
	int high_speed = 0;

	//start the RTC
	Init_RTC();

	__delay_cycles(2000);

	// setup the pins and timers for the motor control
	setupMotor();

	// setup ADC to read from Header J8, SPEED_IN
	setupADC();

	Init_Clock();


	//start motor PWM to 0
	motorSpeed(motor_duty_cycle);
	motorON();

	while (log_num < 8000) {
		//initialze the SPI
		setup_IMU_SPI();

		// grab IMU data
		z_gyro_data = read_IMU_SPI(ZGYRO);

		//store in an array to plot later
		__data20_write_short((unsigned long int)fram_data + row + 4, z_gyro_data);
		//FRAM_write[row][2] = z_gyro_data;

		//capture current ADC value
		current_adc_val = readADC();
		__data20_write_short((unsigned long int)fram_data + row + 6, current_adc_val);
		//FRAM_write[row][3] = current_adc_val;

		//speed up clock to 8MHz
		Init_Clock();

		//get current time in seconds from RTC_C
		currTime = RTC_C_getCalendarTime(RTC_C_BASE);
		curr_sec = currTime.Seconds;
		__data20_write_short((unsigned long int)fram_data + row, curr_sec);
		//FRAM_write[row][0] = curr_sec;

		//grab RTC counter
		rtc_ms =  RTCPS;
		//convert RTC counter to ms
		rtc_ms = (int)(((long)rtc_ms * 1000l)/32768l);
		__data20_write_short((unsigned long int)fram_data + row + 2, rtc_ms);
		//FRAM_write[row][1] = rtc_ms;

		if (second_counter < curr_sec){
			period_counter++;
			if (period_counter == 5){
				if (high_speed == 1){
					motor_duty_cycle = 18000;
					motorSpeed(motor_duty_cycle);
					period_counter = 0;
					high_speed = 0;
				}
				else {
					motor_duty_cycle = 2000;
					motorSpeed(motor_duty_cycle);
					period_counter = 0;
					high_speed = 1;
				}
			}
			second_counter = curr_sec;
		}


		if (blink_count == 100){
			GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
			GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN1);
			blink_count = 0;
		}

		log_num++;
		row = row + 8;
		blink_count++;

		__delay_cycles(32000);
	}

	//slow down and stop the motor
	motorRampDown();
	motorOFF();

	//Open txt file
	SDFindOpenNewFile();
	row = 0;
	blink_count = 0;
	log_num = 0;
//	fram2_start_adr = 0x00010000;

	for(log_num = 0; log_num < 8000; log_num++){
		//convert int to char string
		//__data20_read_short(fram2_start_adr);
		itoa(__data20_read_short((unsigned long int)fram_data + row), time_sec, 10);
		itoa(__data20_read_short((unsigned long int)fram_data+ row + 2), curr_ms, 10);
		itoa(__data20_read_short((unsigned long int)fram_data+ row + 4), z_gyro_char, 10);
		itoa(__data20_read_short((unsigned long int)fram_data+ row + 6), adc_char, 10);

		row = row + 8;

		//write all data to a single line in the currently open txt file
		writeDataSameLine_4(time_sec, curr_ms, z_gyro_char, adc_char);

		//keep track when to give status blink
		blink_count++;
		if (blink_count == 100){
			GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
			blink_count = 0;
		}
	}

	//close the currently open txt file
	SDCloseSPI();

	GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
	GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN1);
	while(1);
}

/*
 * GPIO Initialization
 */
void Init_GPIO()
{
    // Set all GPIO pins to output low for low power
    GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P3, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P6, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P7, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setOutputLowOnPin(GPIO_PORT_PJ, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7|GPIO_PIN8|GPIO_PIN9|GPIO_PIN10|GPIO_PIN11|GPIO_PIN12|GPIO_PIN13|GPIO_PIN14|GPIO_PIN15);
//    GPIO_setOutputHighOnPin(GPIO_PORT_P5, GPIO_PIN7);
//
    GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_P3, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_P6, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P7, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_P8, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
//    GPIO_setAsOutputPin(GPIO_PORT_PJ, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7|GPIO_PIN8|GPIO_PIN9|GPIO_PIN10|GPIO_PIN11|GPIO_PIN12|GPIO_PIN13|GPIO_PIN14|GPIO_PIN15);

	// Configure P2.0 - UCA0TXD and P2.1 - UCA0RXD
//	GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0);
//	GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN0);
//    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P2, GPIO_PIN1, GPIO_SECONDARY_MODULE_FUNCTION);

    // Set PJ.4 and PJ.5 as Primary Module Function Input, LFXT.
    GPIO_setAsPeripheralModuleFunctionInputPin(
           GPIO_PORT_PJ,
           GPIO_PIN4 + GPIO_PIN5,
           GPIO_PRIMARY_MODULE_FUNCTION
           );

    // Disable the GPIO power-on default high-impedance mode
    // to activate previously configured port settings
    PMM_unlockLPM5();
}

/*
 * Clock System Initialization
 */
void Init_Clock()
{
    // Set DCO frequency to 8 MHz
    CS_setDCOFreq(CS_DCORSEL_0, CS_DCOFSEL_6);
    //Set external clock frequency to 32.768 KHz
    CS_setExternalClockSource(32768, 0);
    //Set ACLK=LFXT
    CS_initClockSignal(CS_ACLK, CS_LFXTCLK_SELECT, CS_CLOCK_DIVIDER_1);
    // Set SMCLK = DCO with frequency divider of 1
    CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    // Set MCLK = DCO with frequency divider of 1
    CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    //Start XT1 with no time out
    CS_turnOnLFXT(CS_LFXT_DRIVE_3);
}

/*
 * Real Time Clock Initialization
 */
void Init_RTC()
{
    //Setup Current Time for Calendar
    calendar.Seconds    = 0x00;
    calendar.Minutes    = 0x00;
    calendar.Hours      = 0x02;
    calendar.DayOfWeek  = 0x06;
    calendar.DayOfMonth = 0x11;
    calendar.Month      = 0x04;
    calendar.Year       = 0x2017;

    // Initialize RTC with the specified Calendar above
    RTC_C_initCalendar(RTC_C_BASE,
                       &calendar,
                       RTC_C_FORMAT_BCD);

    RTC_C_setCalendarEvent(RTC_C_BASE,
    		               RTC_C_CALENDAREVENT_MINUTECHANGE
    		               );

    RTC_C_clearInterrupt(RTC_C_BASE,
                         RTC_C_TIME_EVENT_INTERRUPT
                         );

    RTC_C_enableInterrupt(RTC_C_BASE, RTC_C_TIME_EVENT_INTERRUPT);

//    TB0CTL |= TBSSEL_1 + ID_2;
//    //enable interrupt
//    //TB0CCTL0 |= CCIE;
//    TBCCR0 = 0x1FE0;
//    TB0CTL |= MC_1;

    //Start RTC Clock
    RTC_C_startClock(RTC_C_BASE);
}


/*
 * Enter Low Power Mode 3.5
 */
void enterLPM35()
{
	// Configure button S2 (P5.5) interrupt
    GPIO_selectInterruptEdge(GPIO_PORT_P5, GPIO_PIN5, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P5, GPIO_PIN5);
    GPIO_clearInterrupt(GPIO_PORT_P5, GPIO_PIN5);
    GPIO_enableInterrupt(GPIO_PORT_P5, GPIO_PIN5);

    // Request the disabling of the core voltage regulator when device enters
    // LPM3 (or LPM4) so that we can effectively enter LPM3.5 (or LPM4.5).
    PMM_turnOffRegulator();

    //Enter LPM3 mode with interrupts enabled
    __bis_SR_register(LPM4_bits + GIE);
    __no_operation();
}


void blinkP1OUT(int blink_number){
	int i;

	for (i=0;i<blink_number;i++)
	{
		GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
		__delay_cycles(5000);
		GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
		__delay_cycles(5000);
	}
}


//
//#pragma vector=TIMER0_B0_VECTOR
//__interrupt void TIMER_B0_ISR(void)
//{
//	TB0CCTL1 &= ~(CCIFG);
//	//GPIO_toggleOutputOnPin(GPIO_PORT_P7, GPIO_PIN5);
//}


